# How to work with data

In [36]:
import pandas as pd
import statistics as stats
import numpy as np

In [35]:
df = pd.read_csv('titanic.csv')
df.iloc[4:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [48]:
total_survive = sum(df.Survived)

total_survive/len(df) * 100

38.38383838383838

In [60]:
round(sum(df.Sex == 'male')/len(df) * 100, 2)

0    male
dtype: object

In [74]:
sum(df.Sex == 'male')/sum(df.Survived)/len(df) * 100

0.1893529183977527

In [73]:
selection = df.Sex == 'male'
df[selection].Survived.mean()

0.18890814558058924

In [75]:
sum(df.Sex == 'female')/sum(df.Survived)/len(df) * 100

0.10304474242096075

In [76]:
selection = df.Sex == 'female'
df[selection].Survived.mean()

0.7420382165605095

In [84]:
selection = df.Survived==1
(df[selection].Sex == 'female').mean()

0.6812865497076024

In [98]:
selection = df.Pclass
print(max(selection))

selection = df.Age
df[selection == max(df.Age)]

3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [121]:
male_in_the_boat = df[df.Sex == 'male']
male_in_first_class = sum(male_in_the_boat.Pclass == 1) # How many male have in first class

female_in_the_boat = df[df.Sex == 'female']
female_in_second_class = sum(female_in_the_boat.Pclass == 2) # How many female in second class
female_in_second_class

76

In [132]:
df[(df.Sex == 'female') & (df.Pclass == 3)].Survived.mean()

0.5